pmo-dataset/graphviz/25.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ParallelGateway_1" -> "Confirm job\napplication";
  "ParallelGateway_1" -> "Process job\napplication";
  "Confirm job\napplication" -> "ParallelGateway_2";
  "Process job\napplication" -> "ParallelGateway_2";
  "Is job application\naccepted?_1" -> "Evaluate job\napplication" [label="Yes"];
  "Evaluate job\napplication" -> "Is job application\naccepted?_2";
  "Is job application\naccepted?_2" -> "ExclusiveGateway_6" [label="Yes"];
  "Interview candidate" -> "Is candidate\nselected?";
  "Is candidate\nselected?" -> "Enter probation\nphase" [label="Yes"];
  "Enter probation\nphase" -> "ParallelGateway_3";
  "ParallelGateway_3" -> "Evaluate company";
  "Evaluate company" -> "ParallelGateway_4";
  "ParallelGateway_3" -> "Evaluate employee";
  "Is one of the rating\nresults C or less?" -> "Do temp-to-perm" [label="No"];
  "Evaluate employee" -> "ParallelGateway_4";
  "Send autogenerated\nrejection Email" -> "ExclusiveGateway_2";
  "Is job application\naccepted?_2" -> "Send rejection Email" [label="No"];
  "Is job application\naccepted?_1" -> "Send autogenerated\nrejection Email" [label="No"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_2";
  "Send rejection Email" -> "ExclusiveGateway_3";
  "ExclusiveGateway_4" -> "ExclusiveGateway_3";
  "Do temp-to-perm" -> "One year";
  "ParallelGateway_2" -> "Is job application\naccepted?_1";
  "Submit job\napplication" -> "Report Required?";
  "Job needed" -> "ExclusiveGateway_1";
  "Report" -> "ExclusiveGateway_5";
  "Report Required?" -> "ExclusiveGateway_5" [label="No"];
  "Report Required?" -> "Report" [label="Yes"];
  "ExclusiveGateway_5" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_4";
  "ExclusiveGateway_6" -> "Interview candidate";
  "ExclusiveGateway_2" -> "Is any job offer\nreceived?";
  "Is any job offer\nreceived?" -> "Submit job\napplication" [label="No"];
  "Is any job offer\nreceived?" -> "ExclusiveGateway_6" [label="Yes"];
  "Is one of the rating\nresults C or less?" -> "ExclusiveGateway_1" [label="Yes"];
  "Is candidate\nselected?" -> "ExclusiveGateway_4" [label="No"];
  "ParallelGateway_4" -> "Is one of the rating\nresults C or less?";
  "One year" -> "Publish applicant's\nreview";
  "Publish applicant's\nreview" -> "Job found";

  "Job needed" [shape=circle];
  "Job found" [shape=circle, penwidth=4];
  "One year" [shape=doublecircle];
  "Is job application\naccepted?_1" [label="Is job application\naccepted?", shape=diamond];
  "Is job application\naccepted?_2" [label="Is job application\naccepted?", shape=diamond];
  "Is candidate\nselected?" [shape=diamond];
  "Is one of the rating\nresults C or less?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "Report Required?" [shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "Is any job offer\nreceived?" [shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
