pmo-dataset/variations/mermaid_with_ids/25.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["Submit job\napplication"]
	User_2["Report"]
	User_3["Interview candidate"]
	User_4["Evaluate job\napplication"]
	User_5["Enter probation\nphase"]
	User_6["Evaluate company"]
	User_7["Evaluate employee"]
	User_8["Do temp-to-perm"]
	User_9["Send rejection Email"]
	Service_1["Confirm job\napplication"]
	Service_2["Process job\napplication"]
	Service_3["Send autogenerated\nrejection Email"]
	Service_4["Publish applicant's\nreview"]
	StartNoneEvent_1(("Job needed"))
	EndNoneEvent_1(("Job found")):::endEvent
	IntermediateTimerEvent_1((("One year")))
	ExclusiveGateway_1{"Is job application\naccepted?"}
	ExclusiveGateway_2{"Is job application\naccepted?"}
	ExclusiveGateway_3{"Is candidate\nselected?"}
	ExclusiveGateway_4{"Is one of the rating\nresults C or less?"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"X"}
	ExclusiveGateway_8{"X"}
	ExclusiveGateway_9{"Report Required?"}
	ExclusiveGateway_10{"X"}
	ExclusiveGateway_11{"Is any job offer\nreceived?"}
	ExclusiveGateway_12{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}

	ParallelGateway_1 --> Service_1
	ParallelGateway_1 --> Service_2
	Service_1 --> ParallelGateway_2
	Service_2 --> ParallelGateway_2
	ExclusiveGateway_1 -->|"Yes"| User_4
	User_4 --> ExclusiveGateway_2
	ExclusiveGateway_2 -->|"Yes"| ExclusiveGateway_12
	User_3 --> ExclusiveGateway_3
	ExclusiveGateway_3 -->|"Yes"| User_5
	User_5 --> ParallelGateway_3
	ParallelGateway_3 --> User_6
	User_6 --> ParallelGateway_4
	ParallelGateway_3 --> User_7
	ExclusiveGateway_4 -->|"No"| User_8
	User_7 --> ParallelGateway_4
	Service_3 --> ExclusiveGateway_6
	ExclusiveGateway_2 -->|"No"| User_9
	ExclusiveGateway_1 -->|"No"| Service_3
	ExclusiveGateway_7 --> ExclusiveGateway_6
	User_9 --> ExclusiveGateway_7
	ExclusiveGateway_8 --> ExclusiveGateway_7
	User_8 --> IntermediateTimerEvent_1
	ParallelGateway_2 --> ExclusiveGateway_1
	User_1 --> ExclusiveGateway_9
	StartNoneEvent_1 --> ExclusiveGateway_5
	User_2 --> ExclusiveGateway_10
	ExclusiveGateway_9 -->|"No"| ExclusiveGateway_10
	ExclusiveGateway_9 -->|"Yes"| User_2
	ExclusiveGateway_10 --> ParallelGateway_1
	ExclusiveGateway_5 --> ExclusiveGateway_8
	ExclusiveGateway_12 --> User_3
	ExclusiveGateway_6 --> ExclusiveGateway_11
	ExclusiveGateway_11 -->|"No"| User_1
	ExclusiveGateway_11 -->|"Yes"| ExclusiveGateway_12
	ExclusiveGateway_4 -->|"Yes"| ExclusiveGateway_5
	ExclusiveGateway_3 -->|"No"| ExclusiveGateway_8
	ParallelGateway_4 --> ExclusiveGateway_4
	IntermediateTimerEvent_1 --> Service_4
	Service_4 --> EndNoneEvent_1
